{
  "config": [
    {
      "config": {
        "activity_regularizer": null,
        "dtype": "float32",
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null,
            "distribution": "uniform"
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "bias_regularizer": null,
        "dilation_rate": [1, 1],
        "trainable": true,
        "kernel_size": [3, 3],
        "strides": [1, 1],
        "use_bias": true,
        "bias_constraint": null,
        "batch_input_shape": [null, 224, 224, 3],
        "data_format": "channels_last",
        "filters": 32,
        "kernel_constraint": null,
        "bias_initializer": { "config": {}, "class_name": "Zeros" },
        "kernel_regularizer": null,
        "name": "conv2d_1",
        "padding": "valid"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "trainable": true,
        "name": "activation_1",
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "data_format": "channels_last",
        "strides": [2, 2],
        "pool_size": [2, 2],
        "trainable": true,
        "name": "max_pooling2d_1",
        "padding": "valid"
      },
      "class_name": "MaxPooling2D"
    },
    {
      "config": {
        "activity_regularizer": null,
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null,
            "distribution": "uniform"
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "bias_regularizer": null,
        "dilation_rate": [1, 1],
        "trainable": true,
        "strides": [1, 1],
        "kernel_size": [3, 3],
        "use_bias": true,
        "bias_constraint": null,
        "bias_initializer": { "config": {}, "class_name": "Zeros" },
        "data_format": "channels_last",
        "filters": 32,
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "name": "conv2d_2",
        "padding": "valid"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "trainable": true,
        "name": "activation_2",
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "data_format": "channels_last",
        "strides": [2, 2],
        "pool_size": [2, 2],
        "trainable": true,
        "name": "max_pooling2d_2",
        "padding": "valid"
      },
      "class_name": "MaxPooling2D"
    },
    {
      "config": {
        "activity_regularizer": null,
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null,
            "distribution": "uniform"
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "bias_regularizer": null,
        "dilation_rate": [1, 1],
        "trainable": true,
        "strides": [1, 1],
        "kernel_size": [3, 3],
        "use_bias": true,
        "bias_constraint": null,
        "bias_initializer": { "config": {}, "class_name": "Zeros" },
        "data_format": "channels_last",
        "filters": 64,
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "name": "conv2d_3",
        "padding": "valid"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "trainable": true,
        "name": "activation_3",
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "data_format": "channels_last",
        "strides": [2, 2],
        "pool_size": [2, 2],
        "trainable": true,
        "name": "max_pooling2d_3",
        "padding": "valid"
      },
      "class_name": "MaxPooling2D"
    },
    {
      "config": { "trainable": true, "name": "flatten_1" },
      "class_name": "Flatten"
    },
    {
      "config": {
        "activity_regularizer": null,
        "units": 512,
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null,
            "distribution": "uniform"
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "bias_regularizer": null,
        "trainable": true,
        "use_bias": true,
        "bias_constraint": null,
        "bias_initializer": { "config": {}, "class_name": "Zeros" },
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "name": "dense_1"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "trainable": true,
        "name": "activation_4",
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": { "rate": 0.5, "trainable": true, "name": "dropout_1" },
      "class_name": "Dropout"
    },
    {
      "config": {
        "activity_regularizer": null,
        "units": 25,
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "scale": 1.0,
            "seed": null,
            "distribution": "uniform"
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "bias_regularizer": null,
        "trainable": true,
        "use_bias": true,
        "bias_constraint": null,
        "bias_initializer": { "config": {}, "class_name": "Zeros" },
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "name": "dense_2"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "trainable": true,
        "name": "activation_5",
        "activation": "softmax"
      },
      "class_name": "Activation"
    }
  ],
  "keras_version": "2.0.8",
  "backend": "tensorflow",
  "class_name": "Sequential"
}
