{"backend": "tensorflow", "keras_version": "2.0.8", "config": {"layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 150, 150, 3], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block1_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block1_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"padding": "valid", "name": "block1_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": false, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 128, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block2_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 128, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block2_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"padding": "valid", "name": "block2_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": false, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 256, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block3_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 256, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block3_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 256, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block3_conv3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"padding": "valid", "name": "block3_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": false, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 512, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block4_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 512, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block4_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 512, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block4_conv3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"padding": "valid", "name": "block4_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": false, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 512, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block5_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 512, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block5_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"bias_constraint": null, "bias_regularizer": null, "filters": 512, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "name": "block5_conv3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"padding": "valid", "name": "block5_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "sequential_1", "config": [{"config": {"name": "flatten_1", "batch_input_shape": [null, 4, 4, 512], "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "units": 25, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]]}, "class_name": "Model"}