{
  "keras_version": "2.0.8",
  "backend": "tensorflow",
  "class_name": "Model",
  "config": {
    "layers": [
      {
        "config": {
          "dtype": "float32",
          "batch_input_shape": [null, 150, 150, 3],
          "name": "input_1",
          "sparse": false
        },
        "name": "input_1",
        "class_name": "InputLayer",
        "inbound_nodes": []
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block1_conv1",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 64,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block1_conv1",
        "class_name": "Conv2D",
        "inbound_nodes": [[["input_1", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block1_conv2",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 64,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block1_conv2",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]
      },
      {
        "config": {
          "pool_size": [2, 2],
          "data_format": "channels_last",
          "name": "block1_pool",
          "trainable": false,
          "padding": "valid",
          "strides": [2, 2]
        },
        "name": "block1_pool",
        "class_name": "MaxPooling2D",
        "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block2_conv1",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 128,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block2_conv1",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block1_pool", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block2_conv2",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 128,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block2_conv2",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]
      },
      {
        "config": {
          "pool_size": [2, 2],
          "data_format": "channels_last",
          "name": "block2_pool",
          "trainable": false,
          "padding": "valid",
          "strides": [2, 2]
        },
        "name": "block2_pool",
        "class_name": "MaxPooling2D",
        "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block3_conv1",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 256,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block3_conv1",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block2_pool", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block3_conv2",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 256,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block3_conv2",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block3_conv3",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 256,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block3_conv3",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]
      },
      {
        "config": {
          "pool_size": [2, 2],
          "data_format": "channels_last",
          "name": "block3_pool",
          "trainable": false,
          "padding": "valid",
          "strides": [2, 2]
        },
        "name": "block3_pool",
        "class_name": "MaxPooling2D",
        "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block4_conv1",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 512,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block4_conv1",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block3_pool", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block4_conv2",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 512,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block4_conv2",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block4_conv3",
          "activity_regularizer": null,
          "trainable": false,
          "filters": 512,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block4_conv3",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]
      },
      {
        "config": {
          "pool_size": [2, 2],
          "data_format": "channels_last",
          "name": "block4_pool",
          "trainable": false,
          "padding": "valid",
          "strides": [2, 2]
        },
        "name": "block4_pool",
        "class_name": "MaxPooling2D",
        "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block5_conv1",
          "activity_regularizer": null,
          "trainable": true,
          "filters": 512,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block5_conv1",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block4_pool", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block5_conv2",
          "activity_regularizer": null,
          "trainable": true,
          "filters": 512,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block5_conv2",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]
      },
      {
        "config": {
          "bias_constraint": null,
          "kernel_size": [3, 3],
          "dilation_rate": [1, 1],
          "kernel_regularizer": null,
          "padding": "same",
          "activation": "relu",
          "use_bias": true,
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "data_format": "channels_last",
          "kernel_constraint": null,
          "name": "block5_conv3",
          "activity_regularizer": null,
          "trainable": true,
          "filters": 512,
          "strides": [1, 1],
          "bias_regularizer": null,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "distribution": "uniform",
              "seed": null,
              "mode": "fan_avg",
              "scale": 1.0
            }
          }
        },
        "name": "block5_conv3",
        "class_name": "Conv2D",
        "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]
      },
      {
        "config": {
          "pool_size": [2, 2],
          "data_format": "channels_last",
          "name": "block5_pool",
          "trainable": true,
          "padding": "valid",
          "strides": [2, 2]
        },
        "name": "block5_pool",
        "class_name": "MaxPooling2D",
        "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]
      },
      {
        "config": [
          {
            "class_name": "Flatten",
            "config": {
              "dtype": "float32",
              "trainable": true,
              "name": "flatten_1",
              "batch_input_shape": [null, 4, 4, 512]
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "bias_constraint": null,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "activation": "relu",
              "use_bias": true,
              "units": 512,
              "kernel_regularizer": null,
              "kernel_constraint": null,
              "name": "dense_1",
              "activity_regularizer": null,
              "trainable": true,
              "bias_regularizer": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "seed": null,
                  "mode": "fan_avg",
                  "scale": 1.0
                }
              }
            }
          },
          {
            "class_name": "Dropout",
            "config": { "trainable": true, "rate": 0.5, "name": "dropout_1" }
          },
          {
            "class_name": "Dense",
            "config": {
              "bias_constraint": null,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "activation": "softmax",
              "use_bias": true,
              "units": 25,
              "kernel_regularizer": null,
              "kernel_constraint": null,
              "name": "dense_2",
              "activity_regularizer": null,
              "trainable": true,
              "bias_regularizer": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "seed": null,
                  "mode": "fan_avg",
                  "scale": 1.0
                }
              }
            }
          }
        ],
        "name": "sequential_1",
        "class_name": "Sequential",
        "inbound_nodes": [[["block5_pool", 0, 0, {}]]]
      }
    ],
    "name": "model_1",
    "output_layers": [["sequential_1", 1, 0]],
    "input_layers": [["input_1", 0, 0]]
  }
}
